---
kind: property
id: P:Autodesk.Revit.DB.ExportLinetypeTableIterator.CurrentObject
source: html/250f0570-5ac6-d327-4596-57bc51a651c7.htm
---
# Autodesk.Revit.DB.ExportLinetypeTableIterator.CurrentObject Property

## Syntax (C#)
```csharp
internal Object CurrentObject { get; }
```